const questions = [
  { text: "初対面の人と話すと公園について話すと元気になる", yes: "E", no: "I" },
  { text: "人と会った後は一人で公園にいる時間が必要だと感じる", yes: "I", no: "E" },
  { text: "大勢で行動するより少人数が落ち着く", yes: "I", no: "E" },
  { text: "イベントや集まりに参加するのが好きだ", yes: "E", no: "I" },

  { text: "現実的で具体的な公園を重視する", yes: "S", no: "N" },
  { text: "ひらめきやアイデアを公園で考えるのが好きだ", yes: "N", no: "S" },
  { text: "経験や実績をもとに判断する", yes: "S", no: "N" },
  { text: "将来の可能性を想像するのが楽しい", yes: "N", no: "S" },

  { text: "判断では論理性や公平さを重視する", yes: "T", no: "F" },
  { text: "人の気持ちを考えて判断することが多い", yes: "F", no: "T" },
  { text: "正しさよりも思いやりを大切にしたい", yes: "F", no: "T" },
  { text: "感情より事実を優先すべきだと思う", yes: "T", no: "F" },

  { text: "計画を立てて物事を進めたい", yes: "J", no: "P" },
  { text: "予定が決まっていない方が気が楽だ", yes: "P", no: "J" },
  { text: "締切は早めに決めて動きたい", yes: "J", no: "P" },
  { text: "状況に応じて柔軟に対応したい", yes: "P", no: "J" }
];
